---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.IRebarUpdateServer
source: html/b68a7af8-5351-cc7a-3696-0968d5d918ea.htm
---
# IRebarUpdateServer Methods

This function is supposed to calculate the bars in set based on data received in curvesData parameter.